#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_api_management.trial_system: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_api_management.trial_system: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [20s elapsed]
data.azurerm_api_management.trial_system: Still reading... [30s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_api_management.trial_system: Still reading... [40s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_api_management.trial_system: Still reading... [50s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.global.module.dns.data.azurerm_cdn_frontdoor_custom_domain.portal_custom_domain: Still reading... [10s elapsed]
data.azurerm_api_management.trial_system: Still reading... [1m0s elapsed]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.global.module.dns.azurerm_dns_zone.account_ioapp_it has been deleted
  - resource "azurerm_dns_zone" "account_ioapp_it" {
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/account.ioapp.it"
      - name                      = "account.ioapp.it" -> null
        tags                      = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["messages"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/messages"
        name                = "messages"
        # (8 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 50000 -> 46000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["notifications"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/notifications"
        name                = "notifications"
      ~ throughput          = 5000 -> 3800
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["profiles"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/profiles"
        name                = "profiles"
        # (7 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 50000 -> 48000
        }

        # (2 unchanged blocks hidden)
    }

  # module.global.module.dns.azurerm_dns_a_record.account will be created
  + resource "azurerm_dns_a_record" "account" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "io-p-rg-external"
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-fe-rg-01/providers/Microsoft.Cdn/profiles/io-p-ioweb-profile-portal-afd-01/afdEndpoints/io-p-itn-ioweb-profile-fde-01"
      + ttl                 = 3600
      + zone_name           = "account.ioapp.it"
    }

  # module.global.module.dns.azurerm_dns_caa_record.account_ioapp_it will be created
  + resource "azurerm_dns_caa_record" "account_ioapp_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }
      + ttl                 = 3600
      + zone_name           = "account.ioapp.it"

      + record {
          + flags = 0
          + tag   = "iodef"
          + value = "mailto:security+caa@pagopa.it"
        }
      + record {
          + flags = 0
          + tag   = "issue"
          + value = "digicert.com"
        }
    }

  # module.global.module.dns.azurerm_dns_caa_record.ioweb_it will be updated in-place
  ~ resource "azurerm_dns_caa_record" "ioweb_it" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/ioapp.it/CAA/@"
        name                = "@"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      - record {
          - flags = 0 -> null
          - tag   = "issue" -> null
          - value = "digicert.com" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.global.module.dns.azurerm_dns_zone.account_ioapp_it will be created
  + resource "azurerm_dns_zone" "account_ioapp_it" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "account.ioapp.it"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "io-p-rg-external"
      + tags                      = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }

      + soa_record (known after apply)
    }

Plan: 3 to add, 5 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 60, in resource "azurerm_web_application_firewall_policy" "api_app":
  60:       rule_group_override {

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)
::error::Terraform exited with code 1.

Error: checking for presence of an existing Service (Subscription: "a2124115-ba74-462f-832a-9192cbd03649"
Resource Group Name: "ts-p-itn-routing-rg-01"
Service Name: "ts-p-itn-apim-01"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/ts-p-itn-apim-01' under resource group 'ts-p-itn-routing-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with data.azurerm_api_management.trial_system,
  on data.tf line 89, in data "azurerm_api_management" "trial_system":
  89: data "azurerm_api_management" "trial_system" {


Error: Front Door Custom Domain: (Custom Domain Name "io-p-itn-ioweb-profile-portal-fdd-01" / Profile Name "io-p-ioweb-profile-portal-afd-01" / Resource Group "io-p-itn-ioweb-fe-rg-01") was not found

  with module.global.module.dns.data.azurerm_cdn_frontdoor_custom_domain.portal_custom_domain,
  on ../_modules/global/modules/dns/dns_account_ioapp_it.tf line 41, in data "azurerm_cdn_frontdoor_custom_domain" "portal_custom_domain":
  41: data "azurerm_cdn_frontdoor_custom_domain" "portal_custom_domain" {
```

</details>
